# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Terrance\Documents\PSoC Creator\SCB_Bootloader_42xx\Bootloadable Blinking LED.cydsn\Bootloadable Blinking LED.cyprj
# Date: Fri, 01 Aug 2014 15:59:15 GMT
#set_units -time ns
create_clock -name {CyHFCLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/hfclk}] -edges {1 3001 6001} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 3001 6001} [list [get_pins {ClockBlock/udb_div_2}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 3001 6001} [list [get_pins {ClockBlock/udb_div_3}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\Terrance\Documents\PSoC Creator\SCB_Bootloader_42xx\Bootloadable Blinking LED.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Terrance\Documents\PSoC Creator\SCB_Bootloader_42xx\Bootloadable Blinking LED.cydsn\Bootloadable Blinking LED.cyprj
# Date: Fri, 01 Aug 2014 15:59:11 GMT
